{
    "economics": [
        { 
            "id": "e1", 
            "text": "What is the ideal way to organize the ownership of property and industry?", 
            "options": [ 
                { 
                    "text": "Private ownership by individuals or corporations", 
                    "next": "e21"
                    
                }, 
                { 
                    "text": "State ownership or central management for the collective good", 
                    "next": "e22"
                    
                },
                { 
                    "text": "Class collaboration where the state organizes society into industrial sectors, unions, or guilds", 
                    "next": "e23"
                    
                },
                { 
                    "text": "Direct ownership by the workers or through local community/craft collectives", 
                    "next": "e24"
                    
                },
                { 
                    "text": "Wide-spread private ownership where every family/individual owns their own small means of production", 
                    "next": "e25"
                    
                }
            ] 
        },
        { 
            "id": "e21", 
            "text": "How should the market operate?", 
            "options": [ 
                { 
                    "text": "With zero state interference; the market is entirely autonomou", 
                    "next": "e31"
                    
                }, 
                { 
                    "text": "As a competitive market but with a strong social safety net and moderate regulation", 
                    "next": "welfare_capitalism"
                    
                }
            ] 
        },
        { 
            "id": "e31", 
            "text": "What is the relationship between the Market and the State's authority?", 
            "options": [ 
                { 
                    "text": "The market should exist within the legal framework of a state", 
                    "next": "laissez_faire"
                    
                }, 
                { 
                    "text": "The market should be used as a counter-economic tool to replace the state", 
                    "next": "agorism"
                    
                }
            ] 
        },
        { 
            "id": "e22", 
            "text": "To what degree does the state manage the economy?", 
            "options": [ 
                { 
                    "text": "The state owns the means of production to generate profit for the nation", 
                    "next": "state_capitalism"
                    
                }, 
                { 
                    "text": "The state manages the economy to fulfill social needs and eliminate profit-seeking", 
                    "next": "socialism"
                    
                },
                { 
                    "text": "The state doesn't own everything but steers private industry toward national goals", 
                    "next": "e32"
                    
                }
            ] 
        },
        { 
            "id": "e32", 
            "text": "By what primary method should the state influence the private economy?", 
            "options": [ 
                { 
                    "text": "Through direct, technocratic planning and state-led investment", 
                    "next": "dirigisme"
                    
                }, 
                { 
                    "text": "Through fiscal policy and spending to manage market cycles", 
                    "next": "keynesianism"
                    
                },
                { 
                    "text": "Through a synthesis of market competition and social justice", 
                    "next": "third_way"
                    
                }
            ] 
        },
        { 
            "id": "e23", 
            "text": "What is the goal of the labor-business relationship?", 
            "options": [ 
                { 
                    "text": "By facilitating voluntary, tripartite negotiations (State-Employer-Union) to maintain a stable welfare state", 
                    "next": "neo_corporatism"
                    
                }, 
                { 
                    "text": "By absorbing both unions and businesses into state-run corporations to ensure they serve the national interest above all else", 
                    "next": "corporatism"
                    
                },
                { 
                    "text": "By empowering workers' syndicates to take a leading role over the bourgeoisie within a national-revolutionary framework", 
                    "next": "social_corporatism"
                    
                },
                { 
                    "text": "By creating parallel unions and business groups that negotiate directly for profit-sharing", 
                    "next": "yellow_socialism"
                    
                }
            ] 
        },
        { 
            "id": "e24", 
            "text": "How is the worker-led economy structured?", 
            "options": [ 
                { 
                    "text": "Workers manage their own shops, trading based on \"labor for labor\" value", 
                    "next": "mutualism"
                    
                }, 
                { 
                    "text": "Workers manage their crafts through semi-autonomous guilds that coordinate with the community", 
                    "next": "guild_socialism"
                    
                },
                { 
                    "text": "A federation of industrial labor unions manages all production directly", 
                    "next": "syndicalism"
                    
                },
                { 
                    "text": "Social ownership of production, but goods are traded in a competitive market", 
                    "next": "market_socialism"
                    
                }
            ] 
        },
        { 
            "id": "e25", 
            "text": "How should small-scale property be maintained?", 
            "options": [ 
                { 
                    "text": "Through voluntary mutual-aid banks and local co-operation", 
                    "next": "mutual_distributism"
                    
                }, 
                { 
                    "text": "Through state intervention to break up large concentrations of capital", 
                    "next": "social_distributism"
                    
                },
                { 
                    "text": "Simply as an ideal of \"small is beautiful\" with minimal intervention", 
                    "next": "distributism"
                    
                }
            ] 
        },
        { "id": "welfare_capitalism" },
        { "id": "laissez_faire" },
        { "id": "agorism" },
        { "id": "state_capitalism" },
        { "id": "socialism" },
        { "id": "dirigisme" },
        { "id": "keynesianism" },
        { "id": "third_way" },
        { "id": "neo_corporatism" },
        { "id": "corporatism" },
        { "id": "social_corporatism" },
        { "id": "yellow_socialism" },
        { "id": "mutualism" },
        { "id": "guild_socialism" },
        { "id": "syndicalism" },
        { "id": "market_socialism" },
        { "id": "mutual_distributism" },
        { "id": "social_distributism" },
        { "id": "distributism" }
    ],
    "taxation": [  
        { 
            "id": "t1", 
            "text": "Is the state's power to tax its citizens legitimate?", 
            "options": [ 
                { 
                    "text": "No; all funding for public services must be strictly voluntary", 
                    "next": "Voluntaryism"
                    
                }, 
                { 
                    "text": "Yes; it is a necessary tool for the state to function", 
                    "next": "t2"
                    
                }
            ] 
        },
        {
            "id": "t2", 
            "text": "What should be the primary target of taxation?", 
            "options": [ 
                { 
                    "text": "The unearned value of land and natural resources, rather than labor.", 
                    "next": "t31"
                    
                }, 
                { 
                    "text": "The income, wealth, or spending of individuals and businesses", 
                    "next": "t32"
                    
                }
            ] 
        },
        {
            "id": "t31", 
            "text": "How should the revenue from a tax on land values be utilized?", 
            "options": [ 
                { 
                    "text": "Use the land tax only to fund essential government functions", 
                    "next": "georgism"
                    
                }, 
                { 
                    "text": "Use the land tax to fund a social safety net", 
                    "next": "social_georgism"
                    
                }
            ] 
        },
        {
            "id": "t32", 
            "text": "How should the burden of taxation be distributed across different income levels?", 
            "options": [ 
                { 
                    "text": "Everyone should pay the exact same percentage of their income", 
                    "next": "flat_taxation"
                    
                }, 
                { 
                    "text": "Those with higher incomes should pay a higher percentage", 
                    "next": "Progressive_Taxation"
                    
                },
                { 
                    "text": "The state should levy extremely high taxes (approaching 100%) on top wealth or inheritance to prevent any accumulation", 
                    "next": "Confiscatory_Taxation"
                    
                }
            ] 
        },
        { "id": "Voluntaryism" },
        { "id": "georgism" },
        { "id": "social_georgism" },
        { "id": "flat_taxation" },
        { "id": "Progressive_Taxation" },
        { "id": "Confiscatory_Taxation" }
    ],
    "culture": [
        { 
            "id": "c1", 
            "text": "Which statement best describes your view on the trajectory of human civilization?", 
            "options": [ 
                { 
                    "text": "We are gradually moving toward greater reason, liberty, and the correction of ancestral prejudices.", 
                    "next": "c21"
                    
                }, 
                { 
                    "text": "We must preserve the inherited wisdom of the past while allowing for cautious, incremental improvement.", 
                    "next": "c22"
                    
                },
                { 
                    "text": "Modernity is fundamentally flawed or in a state of terminal entropy; the current order is failing and spiritually hollow.", 
                    "next": "c23"
                    
                },
                { 
                    "text": "There is no objective \"progress\" or \"truth\"; there are only competing narratives and structures of power that we must deconstruct.", 
                    "next": "postmodernism"
                    
                }
            ] 
        },
        { 
            "id": "c21", 
            "text": "What should be the primary objective of cultural evolution?", 
            "options": [ 
                { 
                    "text": "The state should be a neutral arbiter, ensuring equal rights and opportunities for all citizens regardless of their cultural or ethnic identity", 
                    "next": "civil_liberalism"
                    
                }, 
                { 
                    "text": "We should prioritize the maximum freedom of the individual to define their own lifestyle, liberated from the constraints of traditional dogma", 
                    "next": "progressivism"
                    
                },
                { 
                    "text": "We must proactively dismantle historical hierarchies and systemic power structures to achieve true social equity", 
                    "next": "social_progressivism"
                    
                }
            ] 
        },
        { 
            "id": "c22", 
            "text": "What is the most essential pillar for maintaining social cohesion?", 
            "options": [ 
                { 
                    "text": "The preservation of individual rights is the highest tradition; the \"old ways\" are best protected by leaving people alone.", 
                    "next": "conservative_liberalism"
                    
                }, 
                { 
                    "text": "A synthesis of freedom and the active encouragement of traditional family structures and religious values", 
                    "next": "liberal_conservatism"
                    
                },
                { 
                    "text": "We accept modern social shifts but implement them through established institutions", 
                    "next": "progressive_conservatism"
                    
                },
                { 
                    "text": "Adherence to the specific customs, religious heritage, and historical identity of one’s own nation and people", 
                    "next": "conservatism"
                    
                }
            ] 
        },
        { 
            "id": "c23", 
            "text": "How should we address the perceived failures of the modern era?", 
            "options": [ 
                { 
                    "text": "We should seek to return to the social hierarchies and political structures of a specific prior era", 
                    "next": "reactionaryism"
                    
                }, 
                { 
                    "text": "Rejection of globalism and interventionism in favor of localism, national sovereignty, and the preservation of the distinct", 
                    "next": "paleoconservatism"
                    
                },
                { 
                    "text": "A dismissal of democratic cathedra in favor of a clear, centralized, and technocratic authority", 
                    "next": "neoreactionaryism"
                    
                }, 
                { 
                    "text": "A rejection of the secular world in favor of the universal, sacred truths found in ancient civilizations", 
                    "next": "traditionalism"
                    
                }
            ] 
        },
        { "id": "postmodernism" },
        { "id": "civil_liberalism" },
        { "id": "progressivism" },
        { "id": "social_progressivism" },
        { "id": "conservative_liberalism" },
        { "id": "liberal_conservatism" },
        { "id": "progressive_conservatism" },
        { "id": "conservatism" },
        { "id": "reactionaryism" },
        { "id": "paleoconservatism" },
        { "id": "neoreactionaryism" },
        { "id": "traditionalism" }
    ],
    "authority": [
        { 
            "id": "a1", 
            "text": "How much power should the state have over the individual?", 
            "options": [ 
                { 
                    "text": "The state is necessary to organize society and enforce order", 
                    "next": "a21"
                    
                }, 
                { 
                    "text": "The state should only exist to protect property and safety", 
                    "next": "minarchism"
                    
                },
                { 
                    "text": "None", 
                    "next": "anarchism"
                    
                }
            ] 
        },
        { 
            "id": "a21", 
            "text": "Should power be concentrated in a single individual or a small group?", 
            "options": [ 
                { 
                    "text": "A single person should hold all the power", 
                    "next": "a31"
                    
                }, 
                { 
                    "text": "Elite group should rule the state", 
                    "next": "a32"
                    
                },
                { 
                    "text": "No, state should be ruled by people", 
                    "next": "a33"
                    
                }
            ] 
        },
        { 
            "id": "a31", 
            "text": "What is the source of the leader's legitimacy?", 
            "options": [ 
                { 
                    "text": "Bloodline or tradition", 
                    "next": "a41"
                    
                }, 
                { 
                    "text": "God", 
                    "next": "a42"
                    
                },
                { 
                    "text": "Raw power", 
                    "next": "a43"
                }
            ] 
        },
        { 
            "id": "a41", 
            "text": "What power should king have?", 
            "options": [ 
                { 
                    "text": "Absolute", 
                    "next": "absolute"
                    
                }, 
                { 
                    "text": "Limited", 
                    "next": "constitutional"
                    
                }
            ] 
        },
        { 
            "id": "a42", 
            "text": "State should be run by...", 
            "options": [ 
                { 
                    "text": "Priesthood", 
                    "next": "theocracy"
                    
                }, 
                { 
                    "text": "Religious but secular leader", 
                    "next": "religious_authoritarianism"
                    
                }
            ] 
        },
        { 
            "id": "a43", 
            "text": "What power should state have?", 
            "options": [ 
                { 
                    "text": "The state controls every aspect of public and private life", 
                    "next": "totalitarianism"
                    
                }, 
                { 
                    "text": "Power is concentrated, but private life remains autonomous", 
                    "next": "autocracy"
                    
                }
            ] 
        },
        { 
            "id": "a32", 
            "text": "What qualifies this group to lead?", 
            "options": [ 
                { 
                    "text": "Scientists, engineers, and data-driven experts", 
                    "next": "technocracy"
                    
                }, 
                { 
                    "text": "Those who have shown the most talent or achievement in their fields", 
                    "next": "meritocracy"
                    
                },
                { 
                    "text": "A single political party", 
                    "next": "partocracy"
                    
                },
                { 
                    "text": "Military chiefs", 
                    "next": "stratocracy"
                    
                }
            ] 
        },
        { 
            "id": "a33", 
            "text": "How should the will of the people be exercised?", 
            "options": [ 
                { 
                    "text": "Citizens vote on every major policy and law themselves", 
                    "next": "direct_democracy"
                    
                }, 
                { 
                    "text": "Citizens elect officials to make decisions on their behalf", 
                    "next": "representative_democracy"
                    
                }
            ] 
        },
        { "id": "theocracy" },
        { "id": "absolute" },
        { "id": "constitutional" },
        { "id": "totalitarianism" },
        { "id": "religious_authoritarianism" },
        { "id": "autocracy" },
        { "id": "anarchism" },
        { "id": "minarchism" },
        { "id": "partocracy" },
        { "id": "meritocracy" },
        { "id": "technocracy" },
        { "id": "representative_democracy" },
        { "id": "direct_democracy" },
        { "id": "stratocracy" }
    ],
    "nation": [
        { 
            "id": "n1", 
            "text": "What is the primary source of an individual’s identity and loyalty?", 
            "options": [ 
                { 
                    "text": "The global human community", 
                    "next": "n21"
                    
                }, 
                { 
                    "text": "A shared legal system, political values, or a common culture within a state.", 
                    "next": "n22"
                    
                },
                { 
                    "text": "Biological descent, shared ancestry, or the blood.", 
                    "next": "n23"
                    
                }
            ] 
        },
        {
        "id": "n21", 
            "text": "How should the world be organized?", 
            "options": [ 
                { 
                    "text": "Through a cooperative system of sovereign nations working together.", 
                    "next": "Internationalism"
                    
                }, 
                { 
                    "text": "Through a borderless world where everyone is a \"citizen of the world.\"", 
                    "next": "Cosmopolitanism"
                    
                }
            ] 
        },
        {
        "id": "n22", 
            "text": "What defines the national bond?", 
            "options": [ 
                { 
                    "text": "Adherence to the Constitution, the law, and civic participation.", 
                    "next": "civic_nationalism"
                    
                }, 
                { 
                    "text": "Adherence to a specific language, religion, and historical heritage.", 
                    "next": "cultural_nationalism"
                    
                }
            ] 
        },
        {
        "id": "n23", 
            "text": "At what scale should biological identity be organized?", 
            "options": [ 
                { 
                    "text": "The local, organic group or clan", 
                    "next": "Tribalism"
                    
                }, 
                { 
                    "text": "A specific ethnic group tied to a historical homeland and state", 
                    "next": "ethnic_nationalism"
                    
                },
                { 
                    "text": "A broad group of related ethnicities", 
                    "next": "pan_nationalism"
                    
                }, 
                { 
                    "text": "The entire race as a single unit, transcending all specific ethnic or national lines", 
                    "next": "racial_nationalism"
                    
                }
            ] 
        },
        { "id": "Internationalism" },
        { "id": "Cosmopolitanism" },
        { "id": "civic_nationalism" },
        { "id": "cultural_nationalism" },
        { "id": "ethnic_nationalism" },
        { "id": "pan_nationalism" },
        { "id": "racial_nationalism" },
        { "id": "Tribalism" }
    ],
    "foreign": [
        { 
            "id": "f1", 
            "text": "What should be the primary goal of our country's actions on the world stage?", 
            "options": [ 
                { 
                    "text": "Protecting our own borders and remaining self-sufficient", 
                    "next": "f21"
                    
                }, 
                { 
                    "text": "Managing power dynamics to ensure our national survival and advantage", 
                    "next": "f22"
                    
                },
                { 
                    "text": "Spreading our values or maintaining global stability for the good of all", 
                    "next": "f23"
                    
                }
            ] 
        },
        { 
            "id": "f21", 
            "text": "To what extent should we interact with others?", 
            "options": [ 
                { 
                    "text": "We should have no political, military, or significant economic ties", 
                    "next": "Isolationism"
                    
                }, 
                { 
                    "text": "We should trade and talk with others, but strictly refuse to interfere in their internal conflicts or wars", 
                    "next": "Non_Interventionism"
                    
                }
            ] 
        },
        { 
            "id": "f22", 
            "text": "How should we exert our influence?", 
            "options": [ 
                { 
                    "text": "By forming alliances only when they benefit us, regardless of the other country's morals", 
                    "next": "Realpolitik"
                    
                }, 
                { 
                    "text": "By actively expanding our territory or controlling other nations' resources and politics to benefit our own", 
                    "next": "Imperialism"
                    
                }
            ] 
        },
        { 
            "id": "f23", 
            "text": "How should we lead the global community?", 
            "options": [ 
                { 
                    "text": "By using our military and political power to step into foreign conflicts to stop bad actors or protect human rights", 
                    "next": "Interventionism"
                    
                }, 
                { 
                    "text": "By moving toward a unified global system of laws, open borders, and international governing bodies", 
                    "next": "Globalism"
                    
                }
            ] 
        },
        { "id": "Isolationism" },
        { "id": "Non_Interventionism" },
        { "id": "Realpolitik" },
        { "id": "Imperialism" },
        { "id": "Interventionism" },
        { "id": "Globalism" }
    ]
}
